Feature: Role & Permission Management

Scenario: case1: ทดสอบส่วนการเข้าหน้าจอ Role & Permission 
Scenario: case1: ทดสอบส่วนการ Sorting ข้อมูลของ Role & Permission 
Scenario: case1: ทดสอบส่วนการค้นหาแบบ Globle Search กรณีมีข้อมูลอยู่ในระบบ
Scenario: case1: ทดสอบส่วนการค้นหาแบบ Globle Search กรณีไม่มีข้อมูลอยู่ในระบบ
Scenario: case1: ทดสอบส่วนการยกเลิกการค้นหาข้อมูลก่อนหน้า
Scenario: case1: ทดสอบส่วนการแสดงหน้าจอจัดการสิทธิ์การเข้าใช้งาน
Scenario: case1: ทดสอบส่่วนการค้นหาของบัญชีผู้ใช้งานที่มีอยู่ในระบบ หน้าจอ Permission Management
Scenario: case1: ทดสอบส่่วนการค้นหาของบัญชีผู้ใช้งานที่ไม่มีอยู่ในระบบ หน้าจอ Permission Management
Scenario: case1: ทดสอบส่่วนการค้นหาสิทธิ์ในการเข้าถึงแต่ละเมนูที่มีอยู่ในระบบ หน้าจอ Permission Management
Scenario: case1: ทดสอบส่่วนการค้นหาสิทธิ์ในการเข้าถึงแต่ละเมนูที่ไม่มีอยู่ในระบบ หน้าจอ Permission Management
Scenario: case1: ทดสอบส่วนการเพิ่มสิทธิ์ในการเข้าถึงแต่ละเมนู จำนวน 1 บัญชีผู้ใช้งาน และคลิกปุ่ม (Button) บันทึก
Scenario: case1: ทดสอบส่วนการเพิ่มสิทธิ์ในการเข้าถึงแต่ละเมนู มากกว่า 1 บัญชีผู้ใช้งาน และคลิกปุ่ม (Button) บันทึก
Scenario: case1: ทดสอบส่วนการลบสิทธิ์ในการเข้าถึงแต่ละเมนู และคลิกปุ่ม (Button) บันทึก
Scenario: case1: ทดสอบส่วนการเพิ่มสิทธิ์ในการเข้าถึงแต่ละเมนู จำนวน 1 บัญชีผู้ใช้งาน และคลิกปุ่ม (Button) บันทึก
Scenario: case1: ทดสอบส่วนการเพิ่มสิทธิ์ในการเข้าถึงแต่ละเมนู โดยไม่เลือกบัญชีผู้ใช้งาน และคลิกปุ่ม (Button) บันทึก
Scenario: case1: ทดสอบส่วนการเพิ่มสิทธิ์ในการเข้าถึงแต่ละเมนู โดยไม่เลือกบัญชีผู้ใช้งาน ไม่เลือกมอดูล และคลิกปุ่ม (Button) บันทึก
Scenario: case1: ทดสอบส่วนการแสดงรายละเอียดในการเข้าใช้บริการต่างๆ ของแต่ละบัญชีผู้ใช้งาน